{
  "letter": "x",
  "count": 9,
  "terms": [
    {
      "id": "term-x-risk",
      "term": "X-Risk",
      "definition": "Shorthand for existential risk, referring to catastrophic scenarios that could result in human extinction or permanent civilizational collapse. AI is considered one of several potential sources of x-risk.",
      "tags": [
        "AI Safety",
        "AI Ethics"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-xai-company",
      "term": "xAI",
      "definition": "Elon Musk's AI company, creator of the Grok chatbot. Founded in 2023, it aims to develop AI that can understand the universe and has access to real-time X (Twitter) data.",
      "tags": [
        "Company",
        "LLM Provider"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-xai",
      "term": "XAI (Explainable AI)",
      "definition": "The field focused on making AI decisions understandable to humans. Includes techniques for visualizing attention, attributing outputs to inputs, and generating explanations.",
      "tags": [
        "Field",
        "Transparency"
      ],
      "domain": "safety",
      "link": null,
      "related": []
    },
    {
      "id": "term-xavier-initialization",
      "term": "Xavier Initialization",
      "definition": "A weight initialization method that samples weights from a distribution scaled by the number of input and output neurons, designed to maintain activation variance across layers with sigmoid or tanh activations.",
      "tags": [
        "Neural Networks",
        "Architecture"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-xgboost",
      "term": "XGBoost",
      "definition": "An optimized implementation of gradient boosting that uses regularized objectives, column subsampling, and efficient tree construction algorithms. It includes built-in handling of missing values and parallel processing.",
      "tags": [
        "Machine Learning",
        "Model Selection"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-xla-compiler",
      "term": "XLA Compiler",
      "definition": "Accelerated Linear Algebra, a domain-specific compiler for machine learning that optimizes computation graphs through operator fusion, memory layout optimization, and hardware-specific code generation. XLA is used by JAX and TensorFlow for GPU and TPU compilation.",
      "tags": [
        "Inference Infrastructure",
        "Model Optimization"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-xlnet",
      "term": "XLNet",
      "definition": "A generalized autoregressive pretraining method that uses permutation-based training to capture bidirectional context while maintaining autoregressive formulation, overcoming limitations of masked language modeling.",
      "tags": [
        "Neural Networks",
        "Architecture"
      ],
      "domain": "models",
      "link": null,
      "related": []
    },
    {
      "id": "term-xml-prompting",
      "term": "XML Prompting",
      "definition": "A prompting technique that uses XML tags to structure prompt sections, delimit input data, and specify output format, leveraging hierarchical markup to provide clear boundaries between instructions, context, and expected response structure.",
      "tags": [
        "Prompt Engineering",
        "Output Format"
      ],
      "domain": "hardware",
      "link": null,
      "related": []
    },
    {
      "id": "term-xml-tags",
      "term": "XML Tags (in Prompting)",
      "definition": "Using XML-style markup tags to structure prompts and clearly delineate sections such as context, examples, or instructions. Helps models parse complex prompts more reliably by providing explicit boundaries between different content types.",
      "tags": [
        "Prompting",
        "Technique"
      ],
      "domain": "general",
      "link": "../learn/index.html",
      "related": []
    }
  ]
}